{"data":{"talks":{"title":"Search Logs + Machine Learning = Auto-Tagged Inventory","description_html":"<p>Eventbrite is exploring a new machine learning approach that allows us to harvest data from customer search logs and automatically tag events based upon their content. The results have allowed us to provide users with a better inventory browsing experience.</p>","abstract_html":"<p>For e-commerce applications, matching users with the items they want is the name of the game. If they can't find what they want then how can they buy anything?! Typically this functionality is provided through search and browse experience. Search allows users to type in text and match against the text of the items in the inventory. Browse allows users to select filters and slice-and-dice the inventory down to the subset they are interested in. But with the shift toward mobile devices, no one wants to type anymore - thus browse is becoming dominant in the e-commerce experience.</p>\n<p>But there's a problem! What if your inventory is not categorized? Perhaps your inventory is user generated or generated by external providers who don't tag and categorize the inventory. No categories and no tags means no browse experience and missed sales. You could hire an army of taxonomists and curators to tag items - but training and curation will be expensive. You can demand that your providers tag their items and adhere to your taxonomy - but providers will buck this new requirement unless they see obvious and immediate benefit. Worse, providers might use tags to game the system - artificially placing themselves in the wrong category to drive more sales. Worst of all, creating the right taxonomy is hard. You have to structure a taxonomy to realistically represent how your customers think about the inventory.</p>\n<p>Eventbrite is investigating a tantalizing alternative: using a combination of customer interactions and machine learning to automatically tag and categorize our inventory. As customers interact with our platform - as they search for events and click on and purchase events that interest them - we implicitly gather information about how our users think about our inventory. Search text effectively acts like a tag and a click on an event card is a vote for that clicked event is representative of that tag. We are able to use this stream of information as training data for a machine learning classification model; and as we receive new inventory, we can automatically tag it with the text that customers will likely use when searching for it. This makes it possible to better understand our inventory, our supply and demand, and most importantly this allows us to build the browse experience that customers demand.</p>\n<p>In this talk I will explain in depth the problem space and Eventbrite's approach in solving the problem. I will describe how we gathered training data from our search and click logs, and how we built and refined the model. I will present the output of the model and discuss both the positive results of our work as well as the work left to be done. Those attending this talk will leave with some new ideas to take back to their own business.</p>","feedback_url":"https://pyohio.typeform.com/to/wbTfbN","kind":"45-minute Talk","schedule":{"room":"Cartoon 2","start":"2019-07-28T15:15:00"},"speakers":[{"name":"John Berryman","speaker_id":200,"photo":{"local":{"childImageSharp":{"fixed":{"base64":"data:image/jpeg;base64,/9j/2wBDABALDA4MChAODQ4SERATGCgaGBYWGDEjJR0oOjM9PDkzODdASFxOQERXRTc4UG1RV19iZ2hnPk1xeXBkeFxlZ2P/2wBDARESEhgVGC8aGi9jQjhCY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2P/wgARCAAQABQDASIAAhEBAxEB/8QAFwAAAwEAAAAAAAAAAAAAAAAAAAIDBP/EABUBAQEAAAAAAAAAAAAAAAAAAAIB/9oADAMBAAIQAxAAAAGC6s5alyn/xAAaEAABBQEAAAAAAAAAAAAAAAACAAEDERIj/9oACAEBAAEFAt6VFSCNhjfoeV//xAAVEQEBAAAAAAAAAAAAAAAAAAAQEf/aAAgBAwEBPwGH/8QAFREBAQAAAAAAAAAAAAAAAAAAEBH/2gAIAQIBAT8Bp//EABgQAAMBAQAAAAAAAAAAAAAAABARMQAh/9oACAEBAAY/AuZw1If/xAAbEAACAwADAAAAAAAAAAAAAAAAAREhMUFhkf/aAAgBAQABPyFWwzobFZqWEmCufTgIiZBfGf/aAAwDAQACAAMAAAAQc8//xAAWEQADAAAAAAAAAAAAAAAAAAAQEUH/2gAIAQMBAT8Qej//xAAWEQADAAAAAAAAAAAAAAAAAAAAESH/2gAIAQIBAT8QRwh//8QAGhABAQEBAQEBAAAAAAAAAAAAAREAIUExwf/aAAgBAQABPxCls81+MMWuRFh71xwVr65I8IVjI/O4seLItB0gZG//2Q==","width":250,"height":250,"src":"/2019/static/d3a6119938c2bb13f21670042f223754/481ca/200.jpg","srcSet":"/2019/static/d3a6119938c2bb13f21670042f223754/481ca/200.jpg 1x,\n/2019/static/d3a6119938c2bb13f21670042f223754/05ba8/200.jpg 1.5x,\n/2019/static/d3a6119938c2bb13f21670042f223754/73cd1/200.jpg 2x"}}}}}],"youtube_url":"http://youtu.be/0MUlKbvIP3k"},"tutorials":null},"pageContext":{"isCreatedByStatefulCreatePages":false,"id":"b5ed4cde-9dac-58e6-a56a-ef17f6a83c9b"}}