{"data":{"markdownRemark":{"html":"<h2><em>Proposals accepted through May 12 Anywhere on Earth (08:00am ET 2019-05-13)</em></h2>\n<p>Ready to submit a talk? Create a speaker profile and submit proposal(s) via our CFP site: <a href=\"https://cfp.pyohio.org/2019/dashboard/\">cfp.pyohio.org</a>.</p>\n<h2>Questions?</h2>\n<p>Log into our Slack team (<a href=\"https://slack.pyohio.org/\">invitation here</a>) and ask in the #cfp channel or email us at info@pyohio.org.</p>\n<p>If you would like to be matched with a mentor to help with your proposal(s), <a href=\"https://forms.gle/4tUxujRfhiyTbsf8A\">request a mentor here</a>.</p>\n<p>If you are an experienced speaker and would like to volunteer to mentor, <a href=\"https://forms.gle/4nZ7WV27GxLBECNM8\">apply to be a mentor here</a>.</p>\n<h2>Session Formats</h2>\n<ul>\n<li><strong>Talks:</strong> 30-minute presentations (with some select talks given an expanded 45-min time)</li>\n<li><strong>Tutorials:</strong> 120-minute hands-on workshops</li>\n</ul>\n<p>Note: We do not include time for Q&#x26;A however some speakers may choose to take questions during their session. Speakers can let the Session Chair know and they will make an announcement before the session if that is the case.</p>\n<h2>Background</h2>\n<p>PyOhio 2019, the annual Python programming conference for Ohio and the surrounding region, will take place Saturday &#x26; Sunday July 27th-28th, 2019 at The Ohio Union in Columbus, Ohio.</p>\n<p>PyOhio invites all interested people to submit proposals for scheduled talks and tutorials. All topics of interest to the Python community will be considered. Standard presentation talk slots will be 30 minutes with select talks being given 45 minutes. Tutorial slots will be 120 minutes long.</p>\n<h2>Who Should Submit a Proposal?</h2>\n<p>You. Your friends. Your friends' friends. Anyone with any level of Python knowledge is a candidate for a great topic at this conference. As we get attendees of all kinds, we need speakers of all kinds. In all ways and manners, we try to assemble the most diverse conference we can, and we do that with your help.</p>\n<p>Whether you got started with Python last month or you've been around for 20 years, we think you've got something to share. The Python community is stronger than ever and we're still reaching new areas, new industries, and new users. Be a part of growing Python by helping us change the future.</p>\n<p>In particular, we welcome submissions from people that have never done a talk before! And if you want help preparing a talk, let us know! Volunteers are eager to help new people with talks.</p>\n<p>You may submit multiple proposals however we will typically only accept one proposal per speaker.</p>\n<h2>Financial Aid / Travel Assistance</h2>\n<p>Unfortunately PyOhio is not able to offer financial aid or travel assistance at this time.</p>\n<p>We prioritize for PyOhio to be free to attend so as many people as possible can participate. By doing so we run with a very lean budget. Financial aid is a goal for the future but until we can secure funding for this we are unable to provide it.</p>\n<h2>Speakers<a name=\"speakers\"></a></h2>\n<p>PyOhio is dedicated to featuring a diverse and inclusive speaker lineup.</p>\n<p><strong>All speakers will be expected to have read and adhere to the conference <a href=\"/2019/about/code-of-conduct\">Code of Conduct</a>. In particular for speakers: slide contents and spoken material should be appropriate for a professional audience including people of many different backgrounds. Sexual language and imagery is not appropriate, and neither are language or imagery that denigrate or demean people based on race, gender, religion, sexual orientation, physical appearance, disability, or body size.</strong></p>\n<p>We will make every effort to provide accommodations for speakers and attendees of all abilities—all we ask is that you let us know so we can prepare accordingly.</p>\n<p>PyOhio is a conference in support of the local programmer community. We aim to feature a mix of local and non-local speakers to offer a program with broad appeal. </p>\n<h2>Resources<a name=\"resources\"></a></h2>\n<p>This <a href=\"https://github.com/vmbrasseur/Public_Speaking\">public speaking</a> repository, maintained by <a href=\"https://twitter.com/vmbrasseur\">VM Brasseur</a>, has many useful resources to help you polish your proposals and talks.</p>\n<p>You may review last years' talk listings for example abstracts:</p>\n<ul>\n<li><a href=\"https://www.pyohio.org/2018/schedule/talks/list/\">2018 talks</a></li>\n<li><a href=\"https://www.pyohio.org/2018/schedule/tutorials/list/\">2018 tutorials</a></li>\n<li><a href=\"https://www.pyohio.org/2017/schedule/talks/list/\">2017 talks</a></li>\n<li><a href=\"https://www.pyohio.org/2017/schedule/tutorials/list/\">2017 tutorials</a></li>\n</ul>\n<h2>Submitting<a name=\"submitting\"></a></h2>\n<p>To help us evaluate proposals and build our program, we would like as much detail as you can provide on your talk. At a minimum this should include: <strong>a brief description (~400 characters) suitable for inclusion in a schedule page; a brief prose abstract (intended as the content for a talk detail page on the program site); and, if you'd like, a rough outline of the structure including estimated timings for each section of your talk.</strong></p>\n<p>If you've given your talk before, links to video or slides would be excellent, or if you've blogged about this topic links to your blog posts would be of use as well.</p>\n<p>Your speaker profile includes a space for you to describe your prior experience giving talks—this is your chance to talk yourself up and explain how you're qualified to share your ideas, so take advantage of it!</p>\n<h2>How to Write Your Proposal<a name=\"how-to-write-your-proposal\"></a></h2>\n<p>If you have an idea and want to speak, here's a very rough process of what you should do next:</p>\n<ul>\n<li>Brainstorm or <a href=\"https://en.wikipedia.org/wiki/Mind_map\">mind map</a> to expand upon your ideas or knowledge in search of a general topic</li>\n<li>Write a paragraph or two, or some bullet points, to outline the core concepts you want to communicate and what people might learn from your talk</li>\n<li>Get someone you trust to read your notes and tell you what they think they'd learn</li>\n<li>Join us in Slack and discuss it in the #cfp channel: <a href=\"https://slack.pyohio.org/\">https://slack.pyohio.org/</a></li>\n<li>Submit your proposal on <a href=\"https://cfp.pyohio.org/2019/dashboard/\">cfp.pyohio.org</a></li>\n<li>Practice!</li>\n</ul>","frontmatter":{"title":"Call For Proposals"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"id":"88b66113-97d5-5dee-b4cf-28353622e199"}}