{"data":{"markdownRemark":{"html":"<p>PyOhio is a community event and we want the talk selection to represent the\ninterests of the community.</p>\n<p>To accomplish this we are using a two-phased review process and would like\n<em>your</em> feedback during phase one. Reviewers of all backgrounds and experience\nlevels are welcome!\n<a href=\"/2019/speak/selection\">Selection process details</a>.</p> \n<p><strong>To sign up as a reviewer:</strong></p>\n<ol>\n<li>\n<p>Sign in to your account (or create a new one) on our <a href=\"https://cfp.pyohio.org/\">CFP site</a>.</p>\n</li>\n<li>\n<p>Go to the <a href=\"https://cfp.pyohio.org/2019/dashboard/\">CFP site dashboard page</a>.</p>\n</li>\n<li>\n<p>Scroll to the bottom and look for the Teams box.</p>\n</li>\n<li>\n<p>Click on the \"<a href=\"https://cfp.pyohio.org/2019/teams/proposal-reviewers/\">Proposal Reviewers</a>\" team and click Join.</p>\n</li>\n</ol>\n<p><strong>Once you've joined the team:</strong></p>\n<ol>\n<li>\n<p>Reload the Dashboard screen. You should see a new 'Reviews' section.</p>\n</li>\n<li>\n<p>Read through as many proposals as you can. Sort by total number of reviews and try to review the talks that have the least total reviews first.</p>\n</li>\n<li>\n<p>Use the speaker feedback tab if you want to ask questions, get clarification, or recommend changes to the proposal.</p>\n</li>\n</ol>\n<p><strong>Scoring:</strong></p>\n<p>Scoring is used during the first round of the selection process to provide the selection committee input on which submissions have the greatest interest. Rate the proposal in its current form and please use the following guidelines for scoring:</p>\n<ul>\n<li>++: Good proposal and I would argue for it to be accepted.</li>\n<li>+: OK proposal, but I would not argue for it to be accepted.</li>\n<li>−: Weak proposal, but I would not argue strongly against acceptance.</li>\n<li>−−: Serious issues and I would argue to reject this proposal.</li>\n</ul>\n<p>If the submitter updates the proposal you will have the chance to update your score.</p>\n<p><strong>Note:</strong> If you have submitted a proposal, you will not see it listed in reviewer mode. This is so you do not vote on your own proposal. You are encouraged to both propose and review session submissions if you wish.</p>","frontmatter":{"title":"Review Talk & Tutorial Proposals"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"id":"0b9aecd7-4a2e-5e9a-a3c9-6ee0c735cefb"}}