{"data":{"allTutorials":{"edges":[{"node":{"title":"Enough Python to Fake It","presentation_id":114,"description_html":"<p>A hands-on introduction to the basics of Python programming, plus a high-level,\nconceptual, hand-wavey introduction to the intermediate and advanced Python\ntopics you'll be hearing about all weekend.  You won't become a full-fledged\nPython programmer, but you'll learn enough to get through PyOhio productively,\nand you'll know how to continue your own Python education afterward.</p>","kind":"120-minute Tutorial","speakers":[{"name":"Catherine Devlin"}]}},{"node":{"title":"Hands-On Web UI Testing","presentation_id":133,"description_html":"<p>Unit tests are great, but they don’t catch all bugs because they don’t test features like a user. Never fear! Let’s learn how to write robust, scalable Web UI tests using Python, pytest, and Selenium WebDriver that cover the full stack for any Web app.</p>","kind":"120-minute Tutorial","speakers":[{"name":"Andrew Knight"}]}},{"node":{"title":"Making Games with ppb","presentation_id":117,"description_html":"<p>Learn to make games with Python. ppb aims to make building games simple and fun! We'll cover the basic features of ppb to make a basic game, then dive into the powerful extensibility features it offers to make even more complex games.</p>","kind":"120-minute Tutorial","speakers":[{"name":"Piper Thunstrom"}]}},{"node":{"title":"Probabilistic Programming and Bayesian Inference in Python","presentation_id":116,"description_html":"<p>If you can write a model in sklearn, you can make the leap to Bayesian inference with PyMC3, a user-friendly intro to probabilistic programming (PP) in Python. PP just means building models where the building blocks are probability distributions! And we can use PP to do Bayesian inference easily. Bayesian inference allows us to solve problems that aren't otherwise tractable with classical methods.</p>","kind":"120-minute Tutorial","speakers":[{"name":"Lara Kattan"}]}}]}},"pageContext":{"isCreatedByStatefulCreatePages":true}}