{"data":{"talks":{"title":"Using Dash to Create Interactive Web Apps for Non-Technical Audiences","description_html":"<p>Have you ever struggled with finding ways to present data visualizations and/or results to non-technical audiences in a coherent and engaging manner? In this talk, I'll detail how I overcame such a challenge by using Dash to build an interactive app for firefighters to use during performance testing of their rescue equipment.</p>","abstract_html":"<p>Analytical web applications can serve as a powerful means for scientists and engineers to interact with data and identify trends in a concise and straightforward manner. Such tools can allow users to immediately see the effects of modifying specific input parameters. Additionally, interactive web apps can be utilized to present data visualizations and analysis results in engaging ways.</p>\n<p>Unless you're a full-stack developer, creating these types of web applications may seem quite challenging. Dash, a Python framework written on top of Flask, Plotly.js, and React.js, handles many of the complexities associated with building custom interfaces and provides users the ability to build powerful data visualizations strictly through Python.</p>\n<p>Despite being an intermediate Python user lacking full knowledge of the technologies and protocols required to build web-based applications, I was able to create a UI using Dash. More specifically, I built an interactive dashboard for firefighters to process and interact with sensor data collected during performance testing of their rescue equipment.</p>\n<p>During this talk, I will briefly detail the motivation behind this project. Then, I'll describe how the project progressed to its current state, while highlighting key points that can be applied to the general case of developing interactive web apps for audiences from non-technical backgrounds. To conclude my presentation, I will show a demo of the interactive web app and summarize the key takeaways.</p>","feedback_url":"https://pyohio.typeform.com/to/vspUhM","kind":"30-minute Talk","schedule":{"room":"Barbie Tootle","start":"2019-07-27T12:00:00"},"speakers":[{"name":"Joseph Willi","speaker_id":259,"photo":{"local":{"childImageSharp":{"fixed":{"base64":"data:image/jpeg;base64,/9j/2wBDABALDA4MChAODQ4SERATGCgaGBYWGDEjJR0oOjM9PDkzODdASFxOQERXRTc4UG1RV19iZ2hnPk1xeXBkeFxlZ2P/2wBDARESEhgVGC8aGi9jQjhCY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2P/wgARCAAVABQDASIAAhEBAxEB/8QAGQABAQADAQAAAAAAAAAAAAAAAAUBAgQD/8QAFwEBAAMAAAAAAAAAAAAAAAAAAgADBP/aAAwDAQACEAMQAAAB46cXJVJNR+GoqugHR//EABsQAQACAwEBAAAAAAAAAAAAAAECAwASIRAR/9oACAEBAAEFAqeJbrWyVjL5m7m0n0ef/8QAGREAAgMBAAAAAAAAAAAAAAAAABEBECFh/9oACAEDAQE/AcHylB//xAAVEQEBAAAAAAAAAAAAAAAAAAARIP/aAAgBAgEBPwEj/8QAHBABAAIBBQAAAAAAAAAAAAAAAQARIQMQEiCB/9oACAEBAAY/AluoLlmdR82OTMNHT//EABwQAAICAwEBAAAAAAAAAAAAAAERACExQVEQgf/aAAgBAQABPyFwh0VTOowOx0EPGQjJeCFUD6iFHkzzagCvNxQi/hn/2gAMAwEAAgADAAAAECwPvP/EABkRAQACAwAAAAAAAAAAAAAAAAEAEBExQf/aAAgBAwEBPxAVgYLlBjU//8QAFxEAAwEAAAAAAAAAAAAAAAAAABARYf/aAAgBAgEBPxCiaqf/xAAfEAEAAgEEAwEAAAAAAAAAAAABABEhMUFRcWGBwaH/2gAIAQEAAT8Q3a0QKj31EGo6ApfzGWPtyfSCvuZhJ4Zf7MqRUGonjCLgPWvcFqXefEUpIHBP/9k=","width":250,"height":250,"src":"/2019/static/c43828654fafc4055b3368ace3ded500/481ca/259.jpg","srcSet":"/2019/static/c43828654fafc4055b3368ace3ded500/481ca/259.jpg 1x,\n/2019/static/c43828654fafc4055b3368ace3ded500/05ba8/259.jpg 1.5x,\n/2019/static/c43828654fafc4055b3368ace3ded500/73cd1/259.jpg 2x"}}}}}],"youtube_url":"http://youtu.be/GiNF9diitAM"},"tutorials":null},"pageContext":{"isCreatedByStatefulCreatePages":false,"id":"21a5bb7a-f49e-50c5-912e-0c653b0954af"}}