{"data":{"talks":{"title":"Leave Your Inhibitions at the Database Connection","description_html":"<p>It is easy to cling to the familiar to avoid the unknown – even when unfamiliar approaches better serve your work. My talk explores this fact, specifically, by looking at the technical and emotional dimensions of my less-than-easy journey from writing raw SQL to using the Django ORM.</p>","abstract_html":"<h2>Abstract</h2>\n<p>Reconciling old assumptions with new approaches can be difficult. This reconciliation can be especially difficult, when those assumptions and approaches correspond with one’s emerging professional identity. A musicologist turned developer, a Rubyist turned Pythonist, I know well how intrapersonal tensions can shape (or hinder) approaches to writing code. This talk confronts these tensions by describing the technical and emotional dimensions of my less-than-easy journey from SQL to the Django ORM.</p>\n<p>Django supports two basic approaches to interacting with a database: (1) running queries with the Django database-mapper (more commonly described as the “ORM”), and (2) performing raw SQL. My first Django projects display a strong preference for the latter approach. I came to Django with very limited coding experience. I started my job at a Python shop as a freshly minted grad of Dev Bootcamp, where I had acquired some knowledge of Ruby on Rails and its ORM, but also learned about the possibilities and easeful-ness of SQL. I eschewed the Django ORM, in part because of its seeming unknowableness, but mainly because SQL was a familiar face in an unfamiliar land. In Django, I wrote SQL for simple queries (selecting with a WHERE clause), moderately challenging ones (joining multiple tables + ordering with CASE expressions), and obscenely complex ones (subqueries + aggregate functions + string manipulations). Whatever case, I generally found my queries to be transparent, flexible, and friendly.  </p>\n<p>It took over a year for me to appreciate that the Django ORM does clever and astonishing things. I eventually found joy in annotating querysets with derived values, and I stood in awe of the Prefetch object in elaborate prefetch operations. The ORM, I learned, could produce clean code and also bypass the performance loss that comes with transforming SQL results into more amenable data types (e.g., namedtuple). </p>\n<p>In this talk, I will share some lessons in Django. But also, I will suggest strategies for evaluating solid, familiar approaches and replacing them with alternative ones.</p>","feedback_url":"https://pyohio.typeform.com/to/gtkcy2","kind":"30-minute Talk","schedule":{"room":"Hays Cape","start":"2019-07-28T12:45:00"},"speakers":[{"name":"Regina Compton","speaker_id":203,"photo":{"local":{"childImageSharp":{"fixed":{"base64":"data:image/jpeg;base64,/9j/2wBDABALDA4MChAODQ4SERATGCgaGBYWGDEjJR0oOjM9PDkzODdASFxOQERXRTc4UG1RV19iZ2hnPk1xeXBkeFxlZ2P/2wBDARESEhgVGC8aGi9jQjhCY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2P/wgARCAAeABQDASIAAhEBAxEB/8QAGAABAQEBAQAAAAAAAAAAAAAAAAMEAQL/xAAWAQEBAQAAAAAAAAAAAAAAAAACAQT/2gAMAwEAAhADEAAAAa5dMo4OqGekVpPI5//EAB0QAAEEAgMAAAAAAAAAAAAAAAEAAgMREyIhMTL/2gAIAQEAAQUCl1abZIVLRMoGTtPO7jxdJ/tytf/EABoRAAEFAQAAAAAAAAAAAAAAAAABEBESITH/2gAIAQMBAT8BrjTgvT//xAAUEQEAAAAAAAAAAAAAAAAAAAAg/9oACAECAQE/AR//xAAdEAACAQQDAAAAAAAAAAAAAAABERAAAhIhMVGB/9oACAEBAAY/AtcnVYsl9wLWi6yfkGTP/8QAGxABAAICAwAAAAAAAAAAAAAAAQARIVExQWH/2gAIAQEAAT8hTtlJQIo52nKPEIG9QorToSzIgt+5T6lkkFejBdE7T//aAAwDAQACAAMAAAAQZwU8/8QAGBEBAAMBAAAAAAAAAAAAAAAAAQAQEVH/2gAIAQMBAT8QEpyuEZqf/8QAGREAAgMBAAAAAAAAAAAAAAAAAAEQETEh/9oACAECAQE/EO2oWD0//8QAHRABAAMBAAIDAAAAAAAAAAAAAQARITFBUXHB0f/aAAgBAQABPxAwUCrV0r2JLvwpBuQ24uqI0zXmVq4ehuquO5s+IirVfkJkTwgAOXA9Zj7lhK17ULKrrk//2Q==","width":250,"height":250,"src":"/2019/static/1d14452971e4d9a9709f969aa292e326/481ca/203.jpg","srcSet":"/2019/static/1d14452971e4d9a9709f969aa292e326/481ca/203.jpg 1x,\n/2019/static/1d14452971e4d9a9709f969aa292e326/05ba8/203.jpg 1.5x,\n/2019/static/1d14452971e4d9a9709f969aa292e326/73cd1/203.jpg 2x"}}}}}],"youtube_url":"http://youtu.be/H_NrL7lTV8E"},"tutorials":null},"pageContext":{"isCreatedByStatefulCreatePages":false,"id":"752d29c1-e54b-51b6-8f98-a007deb6d470"}}