{"data":{"markdownRemark":{"html":"<p>\nOn Friday, July 26 Carl Karsten of Next Day Video will be hosting a hackfest in Columbus open to all PyOhio attendees. Please read the details and RSVP instructions below.</p>\n<h2>Hackfest</h2>\n<p>The hackfest will be focused on introducing people to porting and running MicroPython to a variety of micro controllers, including soft cores running on low end FPGAs that run an Open Source tool chain.</p>\n<p>This will be suitable for users, developers and anyone curious. We will have hardware available to play with for anyone who shows up with a laptop and a Github account.</p>\n<p>Helping out on the day will be Tim ‘mithro’ Ansell. Tim started PyCon AU, contributes to too many projects:</p>\n<ul>\n<li><a href=\"https://symbiflow.github.io\">SymbiFlow</a> - “Think of it as the GCC of FPGAs”</li>\n<li><a href=\"http://hdmi2usb.tv\">HDMI2USB</a> - A TimVideos project (used to record PyOhio talks)</li>\n<li><a href=\"http://tomu.im\">Tomu</a> - A microcontroller in your USB port</li>\n<li><a href=\"http://fomu.im\">Fomu</a> - An FPGA in your USB port</li>\n<li><a href=\"https://fupy.github.io\">FuPy</a> - Full stack development (FPGA gateware &#x26; soft CPU firmware) in Python!</li>\n<li><a href=\"https://www.adafruit.com/product/4248\">NeTV2</a> - “Yes, @mithro has given me invaluable guidance and feedback on the design and features, and I also credit (blame?) him for leading me on the path toward migen/LiteX.” <a href=\"https://twitter.com/bunniestudios/status/995338444527222784\">https://twitter.com/bunniestudios/status/995338444527222784</a> </li>\n</ul>\n<p>Carl Karsten of Next Day Video will have a recording system setup for training the PyOhio video crew and anyone else who wants to join us, especially if you want to give a lightning talk about absolutely anything – real talks are the best training.</p>\n<p>The day will center around running FuPy on <a href=\"https://github.com/timvideos/litex-buildenv/wiki\">litex-buildenv</a>.\nThe litex-buildenv project is an SoC (System on Chip) with 3 architectural flavours of microprocessor to choose from; LM32 (lm32), RISC-V (3 implementations!) and OpenRISC 1000 (mor1kx). As for software, you can run code bare metal, in micropython, and on OSes such as Zephyr and Linux. The system builds with open source FPGA tools and runs on iCE40 FPGAs. In addition, Tim will have Fomu hardware to disseminate, and Opsis and NeTV2 hardware for people to hack on.</p>\n<p>For more info on the projects, check these videos out:</p>\n<ul>\n<li><a href=\"https://www.youtube.com/watch?v=AlmVxR0417c\">35C3 - Snakes and Rabbits - How CCC shaped an open hardware success</a> </li>\n<li><a href=\"https://www.youtube.com/watch?v=181-roBM0tI\">Eating Rabbits: A guide to using Python to conquer FPGA video systems</a></li>\n<li><a href=\"http://youtu.be/v7WrTmexod0\">Tim has too many projects - LatchUp Edition</a></li>\n</ul>\n<p><em>Is this hackfest for you?</em></p>\n<p>If you're proficient (or near enough!) in HDLs, software, and debugging embedded systems and would like to get involved, or exposed to some new tools, then come on down! Or even if you just want to drop by and say hi and look over people's shoulders, that's fine too.</p>\n<p><em>Still not sure, or you want to get a head start on set up to be productive?</em></p>\n<ul>\n<li>Try building MicroPython on your favorite OS: <a href=\"https://github.com/micropython/micropython\">https://github.com/micropython/micropython</a></li>\n<li>It isn’t easy, you will likely be helped by this: <a href=\"https://github.com/libffi/libffi/issues/210\">https://github.com/libffi/libffi/issues/210</a></li>\n<li>Once you get [4, 2, 1, 9… Try <a href=\"https://github.com/timvideos/litex-buildenv/wiki/HowTo-LCA2018-FPGA-Miniconf\">https://github.com/timvideos/litex-buildenv/wiki/HowTo-LCA2018-FPGA-Miniconf</a></li>\n</ul>\n<p>There is a 20gig download of closed source vendor lockin things, but currently that is the only option for the high end FPGAs. Maybe next year will be a different story.\nIf you can get the right versions of all the pieces in the right place, you should see a linux login prompt.  Loog in as root and cat /proc/cpu.  Congratulations, most people give up.\nIf what we are doing was easy, someone would just do it and we wouldn’t have anything to hack on.\nAt the event, expect more struggle, but with others around to help out. </p>\n<h2>Where and When</h2>\n<p>The event will run from 10am to 8pm, Friday July 26 at:</p>\n<p><a href=\"https://ideafoundry.com\">https://ideafoundry.com</a><br>\n421 W. State St.<br>\nColumbus, OH 43215</p>\n<p>Check in at the front desk and wait for someone to collect you.</p>\n<h2>RSVP</h2>\n<p>In order to help us plan the day, we ask that you register that you're intending to come - even if you're just coming to hang out. Please fill in this short form to register.\n<a href=\"https://forms.gle/SsmCmN9uex9tLYNh9\">https://forms.gle/SsmCmN9uex9tLYNh9</a></p>\n<h2>Updates / Questions</h2>\n<p>Last minute updates (I’ll email if you have signed up)\n<a href=\"https://github.com/CarlFK/veyepar/wiki/PyOhio-Hackfest-Updates\">https://github.com/CarlFK/veyepar/wiki/PyOhio-Hackfest-Updates</a></p>\n<p>This event is being run by Carl Karsten so direct any questions to him: carl@NextDayVideo.com\nOr drop into <code>#timvideos</code> on freenode irc.</p>","frontmatter":{"title":"Pre-PyOhio FuPy (MicroPython on FPGAs) Hackfest"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"id":"d5fad9df-bcd9-5c1d-8b6e-0a5a9147fd95"}}