{"data":{"talks":{"title":"A Gentle Introduction to Linear Programming in Python","description_html":"<p>Linear programming is a useful computational technique for finding minima or maxima of a complex system by breaking it into a series of linear equations which describe the systems. It has many practical applications in industry, medicine, agriculture and in retail environments. Together we will explore simple linear programming problems using Python and the module Pulp.</p>","abstract_html":"<h2>What is Linear Programming</h2>\n<p>Linear programming is an optimization method with broad utility. Sadly the study of linear programming is often overlooked in favor of sexier machine learning algorithms by both practitioners and data science educators  (both bootcamps and  graduate programs). However, it is used extensively in many of the fields from which data science evolved and there are useful libraries in most of the major analytical languages. We will spend 5-10 minutes understanding linear programming in general before moving on to code</p>\n<h2>Linear Programming in Python</h2>\n<p>In Python, the most common library is Pulp which we will use to look at two separate optimization problems, one to minimize and one to maximize a desired outcome variable.\nWe will go through:\nSystem requirements\nPackage Installation\nComputational Complexity (floating values &amp; discrete number calculations)</p>\n<h2>Real World Examples with Code</h2>\n<p>We will be setting up and completing the two problems. In doing so we will learn how to simplify a complex system into a series of linear equations.</p>\n<p>We will learn about:\n * Decision Variables - the outcomes we choose to optimize\n * Objective Function - the series of relationships between decision variables which affect the optimization\n * Constraints - the limits on our decision variables which allocate resources \n * How to visualize the problem (it could be a graph or simple illustration)\n * How to  set up the equations defining the problem\n<em> How to solve the series of equations\n</em> How to interpret the results\n* How to know when you can, should or should not use linear programming to solve a problem</p>\n<p>The presentation will be assume a base understanding of python algebra and linear equations (y=mx+b) but it is not going to be presented in a mathematically demanding way. We will look at real-world resource allocation problems and use simple python code to solve them.</p>\n<h3>Resources</h3>\n<p>There will be a fully fleshed out GITHUB repository with:\n * The slides\n * The code\n * Brief instructional README.md with links to other useful online sources</p>","feedback_url":"https://pyohio.typeform.com/to/asj3VO","kind":"30-minute Talk","schedule":{"room":"Cartoon 2","start":"2019-07-27T14:00:00"},"speakers":[{"name":"Bethany Poulin","speaker_id":155,"photo":{"local":{"childImageSharp":{"fixed":{"base64":"data:image/jpeg;base64,/9j/2wBDABALDA4MChAODQ4SERATGCgaGBYWGDEjJR0oOjM9PDkzODdASFxOQERXRTc4UG1RV19iZ2hnPk1xeXBkeFxlZ2P/2wBDARESEhgVGC8aGi9jQjhCY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2P/wgARCAAUABQDASIAAhEBAxEB/8QAGAABAAMBAAAAAAAAAAAAAAAAAAIDBAX/xAAWAQEBAQAAAAAAAAAAAAAAAAABAgD/2gAMAwEAAhADEAAAAeXRfGakqJHWNYRt/8QAGxAAAgMAAwAAAAAAAAAAAAAAAQIAAxIiMUH/2gAIAQEAAQUCWsug7zKXzLQdh54nKuf/xAAWEQEBAQAAAAAAAAAAAAAAAAAQAUH/2gAIAQMBAT8Bwp//xAAVEQEBAAAAAAAAAAAAAAAAAAAQAf/aAAgBAgEBPwEp/8QAGhAAAgIDAAAAAAAAAAAAAAAAAREQQQAgMf/aAAgBAQAGPwIl8xGEbvQuP//EABsQAQACAwEBAAAAAAAAAAAAAAEAESExQRBR/9oACAEBAAE/IaZ+M9gSAFQbpR8NTMBFrMdY7Ww+f//aAAwDAQACAAMAAAAQGxB+/8QAFhEBAQEAAAAAAAAAAAAAAAAAASAh/9oACAEDAQE/EENEP//EABcRAAMBAAAAAAAAAAAAAAAAAAARIRD/2gAIAQIBAT8QdRd//8QAHRABAAICAgMAAAAAAAAAAAAAAQARIVExQbHB0f/aAAgBAQABPxAWCOh2c/JQ1LazubRmdgCCyj1HBoIonmAJddkIV6GMksAMAn//2Q==","width":200,"height":200,"src":"/2019/static/167a85378bacd6e886b4afd8aaabe1be/53de1/155.jpg","srcSet":"/2019/static/167a85378bacd6e886b4afd8aaabe1be/53de1/155.jpg 1x"}}}}}],"youtube_url":"http://youtu.be/H6hk0RhmAAs"},"tutorials":null},"pageContext":{"isCreatedByStatefulCreatePages":false,"id":"fcb26c43-1690-576a-a255-07a0bab2f529"}}