{"data":{"talks":{"title":"Dynamic Data Pipelining with Luigi","description_html":"<p>As the scale of modern data has grown, so has the need for tooling to handle its growing list of challenges. Whether performing reporting, bulk ingestion, or ETL processes, it is important to maintain flexibility and ensure proper monitoring. Luigi provides a robust toolkit to perform a wide variety of data pipelining tasks, and can be easily integrated into existing workflows with ease.</p>","abstract_html":"<p>As the scale of modern data has grown, so too has the need for modern tooling to handle its growing list of needs. Databases have had to become more horizontally scalable, less centralized, and more fault tolerant to handle the expectations of modern users. As such, the concept of data-warehouses and data-engineering are relatively new concepts, and engineers are still hard at work to solve core problems of this new sector. One problem of particular interest is that of dynamic data pipelining and workflows. Ingesting large amounts of data, transforming streams dynamically into a standardized format, and maintaining checkpoints and dependencies in order to ensure that proper prerequisites are met before beginning a given task are all difficult problems. This talk will describe how these problems can be solved using Luigi, Spotify’s robust tool for constructing complex data pipelines and workflows.</p>\n<p>Luigi allows for complex pipelines to be described programmatically, handling multiple dependencies and dependents. This allows it to be used for a wide variety of batch jobs, and the option to use the centralized scheduler makes it easy to monitor job progress across data warehouses. In addition, Luigi’s robust checkpoint system allows for pipelines to resumed at any point they may fail at. Each task is well-defined, specifying required inputs and resulting outputs, so creating or editing pipelines is a breeze.</p>","feedback_url":"https://pyohio.typeform.com/to/HgQlJR","kind":"30-minute Talk","schedule":{"room":"Cartoon 2","start":"2019-07-28T16:15:00"},"speakers":[{"name":"Trey Hakanson","speaker_id":246,"photo":{"local":{"childImageSharp":{"fixed":{"base64":"data:image/jpeg;base64,/9j/2wBDABALDA4MChAODQ4SERATGCgaGBYWGDEjJR0oOjM9PDkzODdASFxOQERXRTc4UG1RV19iZ2hnPk1xeXBkeFxlZ2P/2wBDARESEhgVGC8aGi9jQjhCY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2P/wgARCAAUABQDASIAAhEBAxEB/8QAGAABAQEBAQAAAAAAAAAAAAAAAAMCAQX/xAAXAQEBAQEAAAAAAAAAAAAAAAADBAEC/9oADAMBAAIQAxAAAAHmo0FtJs683RRNcEv/xAAaEAEAAgMBAAAAAAAAAAAAAAABABECAyEi/9oACAEBAAEFAljyXFp2ZFR6vZrfP//EABgRAAIDAAAAAAAAAAAAAAAAAAABEBEh/9oACAEDAQE/AblPD//EABgRAAIDAAAAAAAAAAAAAAAAAAABEBEx/9oACAECAQE/Aal6f//EABgQAAMBAQAAAAAAAAAAAAAAAAEQEQCR/9oACAEBAAY/AsLOsML/xAAbEAEAAwEBAQEAAAAAAAAAAAABABFBIXExUf/aAAgBAQABPyGj5vIXs7wtCDJXdgxuh8hVRqL+x0vhHt7P/9oADAMBAAIAAwAAABDPwIL/xAAYEQADAQEAAAAAAAAAAAAAAAAAAREQUf/aAAgBAwEBPxCO4x0H/8QAFxEBAQEBAAAAAAAAAAAAAAAAAQAREP/aAAgBAgEBPxASbwiav//EABwQAQEBAQACAwAAAAAAAAAAAAERACExQVGBkf/aAAgBAQABPxAUAKgVDq8z69CVB89wz3g02J9sAbKisM+J67lCNMrKriIdjMELwYfhv//Z","width":250,"height":250,"src":"/2019/static/57ff3fd2828ab800a1ec8a119cfc96a2/481ca/246.jpg","srcSet":"/2019/static/57ff3fd2828ab800a1ec8a119cfc96a2/481ca/246.jpg 1x,\n/2019/static/57ff3fd2828ab800a1ec8a119cfc96a2/05ba8/246.jpg 1.5x,\n/2019/static/57ff3fd2828ab800a1ec8a119cfc96a2/73cd1/246.jpg 2x"}}}}}],"youtube_url":"http://youtu.be/5kSnkNDeQjQ"},"tutorials":null},"pageContext":{"isCreatedByStatefulCreatePages":false,"id":"4fd90122-82db-5028-b0a5-a3db00a8d7a4"}}